app/Controllers/Pegawai.php

SELECT *
FROM `users`
---
    public function index()
    {
        $model = new Pegawai_model();
        $data['users'] = $model->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '6'
---
    public function edit($id = null)
    {
        $model = new Pegawai_model();
        $data['users'] = $model->find($id);