app/Controllers/Penggajian.php

    public function index()
    {
        $penggajian = $this->penggajianModel->findAll();

        $data = [];
        foreach ($penggajian as $item) {
            // Convert to object if necessary
            if (is_array($item)) {
                $item = (object) $item;
            }

            $tunjangan = $this->tunjanganModel->find($item->id_tunjangan);
            $potongan = $this->potonganModel->find($item->id_potongan);
---
SELECT *
FROM `penggajian`
SELECT *
FROM `tunjangan`
WHERE `tunjangan`.`id_tunjangan` = '2'
SELECT *
FROM `potongan`
WHERE `potongan`.`id_potongan` = '2'