app/Controllers/Potongan.php

    public function index()
    {
        $model = new PotonganModel();

        $data = [
            'potongan' => $model->findAll(),
        ];
---
SELECT *
FROM `potongan`