app/Controllers/Tunjangan.php

    public function index()
    {
        $tunjangan = $this->tunjanganModel->findAll();
---
SELECT *
FROM `tunjangan`