app/Controllers/User.php

    public function admin()
    {
        // Perform the join operations
        $this->builder->select('users.id as userid, username, email, auth_groups.name');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');

        // Execute the query
        $query = $this->builder->get();
---
SELECT `users`.`id` as `userid`, `username`, `email`, `auth_groups`.`name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`